Процедура ИмяПроцедуры(Параметры)
	НабЗап = РегистрыСведений.РегистрСведений.СоздатьНаборЗаписей();
	НабЗап.Отбор.Измерение.Установить();
	

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Справочник.ВерсияДанных,
		|	Справочник.ИмяПредопределенныхДанных,
		|	Справочник.Код,
		|	Справочник.Наименование
		|ИЗ
		|	Справочник.Справочник КАК Справочник";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		СтрокаТЗ.Код1 = "НовыйКод";
	КонецЦикла;

КонецПроцедуры