

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Реквизит1 = "Глвый";
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПередЗакрытиемНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
	Переменная = фрагмент();
	Реквизит1 = Переменная;
КонецПроцедуры

&НаСервере
Функция фрагмент() Экспорт
	Перем Переменная;
	Переменная = "выавыаыв";
	Возврат Переменная;
КонецФункции
