

// При копировании.
// 
// Параметры:
//  ОбъектКопирования - ДокументОбъект.Документ - Объект копирования
Процедура ПриКопировании(ОбъектКопирования)
	ОбъектКопирования ="Ваываы";
	Номер = "аваываы";
	Номер = "Мастер";
	Номер = "аываыв";
	Номер = "ВеткаДляУдаления";
КонецПроцедуры

// Новая процедура.
Процедура НоваяПроцедура() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	Документ.Проведен1 КАК Проведе1н,
						  |	Документ.Номер
						  |ИЗ
						  |	Документ.Документ КАК Документ");
	ТЗ = Запрос.Выполнить().Выгрузить();

	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	ВременнаяТаблица.Номер
						  |ИЗ
						  |	&ТЗ КАК ВременнаяТаблица");
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
КонецПроцедуры